Revit 2026 API

# UIControlledApplicationDockableFrameFocusChanged Event

---

Subscribe to GenericDockableFrame activated event to be notified when Revit GenericDockableFrame is active or inactive.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<DockableFrameFocusChangedEventArgs> DockableFrameFocusChanged
```
```vb
Public Event DockableFrameFocusChanged As EventHandler(Of DockableFrameFocusChangedEventArgs)
```
```cpp
public:
 event EventHandler<DockableFrameFocusChangedEventArgs^>^ DockableFrameFocusChanged {
	void add (EventHandler<DockableFrameFocusChangedEventArgs^>^ value);
	void remove (EventHandler<DockableFrameFocusChangedEventArgs^>^ value);
}
```
```fsharp
member DockableFrameFocusChanged : IEvent<EventHandler<DockableFrameFocusChangedEventArgs>,
    DockableFrameFocusChangedEventArgs>
```

#### Value

EventHandlerDockableFrameFocusChangedEventArgs

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace